[{
  "_id": {
    "$oid": "61b52306d2099ab4ff770072"
  },
  "text": "A relational database is a database structure built on the “relational model” This usually consists of a series of different tables with data that relate to each other. A table is defined with columns and rows. The columns of the table define the data and the rows are single instances of data with values, which all should have a unique identifier (key or id). Relational databases are really good at structuring data and when built correctly, minimize redundant data storing. Relational databases usually use SQL (Structured Query Language) to manage and maintain the database, furthermore relational databases are maintained in a RDBMS (Relational database management system), like pgAdmin or Phpmyadmin.",
  "activity_id": "1"
},{
  "_id": {
    "$oid": "61b5f436cc52a8a5ff6c8602"
  },
  "text": "Normalization is the process of organizing the data of your database in the best way possible to avoid data redundancy. Data redundancy firstly takes up undesired space in your database and secondly it can be difficult to maintain. As an example if you have a username in two different tables, you would make sure that if the name changes in one place, then it needs to be changed everywhere. If this doesn't happen, the database will end up having uneven data, which in the end can be useless. For that reason we go through the normalization process. Normalization comes in different stages. We look at two stages which are the ones needed for this database design.",
  "activity_id": "2"
},{
  "_id": {
    "$oid": "61b5f436cc52a8a5ff6c8603"
  },
  "text": "1st normal form\n\n    For a table to achieve 1NF (first normal form) it should live up to the following requirements\n    \n    It should only contain atomic values (single values that can not be broken down) in its columns\n    Each column should have unique names\n    ",
  "activity_id": "3"
},{
  "_id": {
    "$oid": "61b5f436cc52a8a5ff6c8604"
  },
  "text": "To achieve 2NF we should do the following\n\n    The table should be in 1NF\n    The table should not have partial dependency\n    \n    Not having partial dependency is when the data in the table only depends on the tables Primary key (or maybe compound key) \n    \n    For the database design of “DB Journey” achieving 2NF is wanted in order for the design to be optimal.\n    \n    ",
  "activity_id": "4"
},{
  "_id": {
    "$oid": "61b5f5faacc473577f782392"
  },
  "text": "When looking at the ERD for the database, looking at the actual relations between the tables are an important thing to be aware of. There are a couple of relations that are worth taking a closer look at.\n    ",
  "activity_id": "5"
},{
  "_id": {
    "$oid": "61b5f5faacc473577f782393"
  },
  "text": "One to one relationship\n\n    The one to one relationships are when two tables are connected where only one single row from each table is associated. \n    \n    One to many relationship\n    \n    The one to many relationship is when two tables are connected and one row from table one is associated with multiple rows in table two. This can be seen in the ERD for “DB Journey” between the “topics” table and the “activities” table. To explain it further, this means that one topic (a row in the topics table) can contain multiple activities in the “activities” table, and an activity in the “activities” table can only relate to one single topic. (meaning that an activity would never occur in more than one topic).\n    ",
  "activity_id": "6"
},{
  "_id": {
    "$oid": "61b5f5faacc473577f782394"
  },
  "text": "Many to many relationships are a bit more complex than the previously mentioned relationships. The many to many relationship is when a row in table one can occur in many rows in table two, but a row in table two can also occur many times in table one. This is a relation that can not be achieved directly. In order to deal with the many to many relationship is to create a so-called “junction table” in between table one and table two. The junction table will then gather an id from both tables and create a unique “compound key” which is then the unique identifier for a relationship. When looking at the ERD for “DB Journey” a many to many relationship occurs between “users” and “topics”. This is because a user can have multiple topics but topics also can have multiple users. That is why the “user_topics” table is created, where it takes both user_id and topic_id as foreign keys, and turns these two into a unique “Compound key” which is when two values are used to create one unique value.",
  "activity_id": "7"
},{
  "_id": {
    "$oid": "61b67863bde7f010a100e122"
  },
  "text": "SQL, or Structured Query Language is the set of instructions used to interact with databases. An incredibly simple definition for such a complex subject.\n\n    SQL is a special purpose programming language designed for managing data stored in a relational database management system. \n    \n     SQL is the language with which a coder communicates with a database in order to manipulate the data held within it. It is their guiding hand, their voice, their fingertips dragging across a screen, helping the coder to navigate and organise the data as they see fit. It is basically how a coder converses with the machine.\n    SQL is a vital tool used by any individual who seeks to pursue a career as a database administrator. For those unfamiliar with programming languages and website architecture, the work of SQL will often go unnoticed, but those who have seen behind the curtain will know it as one of the fundamental building blocks of modern database architecture.\n    ",
  "activity_id": "8"
},{
  "_id": {
    "$oid": "61b67863bde7f010a100e123"
  },
  "text": "All operations you can do on any data can be boiled down to Create, Read, Update, and Delete (CRUD). You can create something new, you can read it, update it, and finally delete it if you wish.\n\n    Naturally it makes sense that SQL would have these 4 operations within the language. The following table shows the corresponding SQL command to the CRUD operation. Also, in this table you can see the HTTP equivalents. It is good to see how CRUD can be found in many ideas across computing.\n    ",
  "activity_id": "9"
},{
  "_id": {
    "$oid": "61b8b69799122b51021ccc82"
  },
  "text": "When creating the application, a series of technologies are needed in order to reach the goal. In the following section, we will look into some of the technologies used and how to set up the databases.\n\n    MAMP\n    MAMP is a free to use local server environment that can be installed on your computer. MAMP is a great tool for developing web applications. When installed you get a local apache server, a series of php versions, mySQL and phpmyadmin.\n    \n    PhpMyAdmin\n    PhpMyAdmin is a RDBMS (Relational DataBase Management System) used to handle the MySQL database used in the application. Inside phpMyAdmin you can perform queries on the database, create tables and data, read, update and delete tables and data (CRUD).\n    ",
  "activity_id": "10"
},{
  "_id": {
    "$oid": "61b8b69799122b51021ccc83"
  },
  "text": "PHP\n    PHP is a server side scripting language. In the application, PHP is used to prepare queries and connect to databases used. \n    \n    Installing MongoDB \n    \n    First off all, in order to install mongoDB on your MacOS you first need some tools in order.\n    When looking at the official MongoDB documentation a series of steps are presented. First step is to install Xcode command-line tools for your system, Xcode is Apple's integrated development environment (IDE) for macOS that is used to develop software.\n    This is a quite simple process that can be done in the terminal. simply by running the following command, Xcode will be installed on the machine and you will be ready to proceed.\n    \n    Step two in the process is to install Homebrew. Homebrew is, as they say themselves, “The missing package manager for macOS” Like any other package manager Homebrew helps provide the necessary tools needed in order to develop software. In this case Homebrew is needed to install the mongoDB environment (Mongo server, cluster and the mongo shell)\n    By running the following commands, everything will be set up and running. It is even possible to now open up MongoDB compass which is  MongoDBs Graphical User Interface (GUI) to work with, query and analyze the database.\n    ",
  "activity_id": "11"
}]